<!-- dflook/terraform-github-actions {"workspace":"json-outpputs-2","backend_type":"remote","backend":"e93fc67356f272baae5622763d2c3930db98a8e1941d01f61b68558e178b82e2","plan_job_ref":"Job Test Terraform cloud #350 at https://github.com/dflook/terraform-github-actions/actions/runs/16657537847","plan_hash":"9d2736325fa15713c21a63da00825468754266ea9c87363247e75a7e0fc0597f","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __json-outpputs-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #350](https://github.com/dflook/terraform-github-actions/actions/runs/16657537847)